IDS_EC_REPORT_CH_TEST = "EC_Report_CH-Test(Lang:CH)"
IDS_EC_FOUNDATION_OVERTURNING_OCCURED = "Overturning occurred. Calculation Canceled."
IDS_EC_FOUNDATION_OVERTURNED = "Overturned"
IDS_EC_FOUNDATION_DESIGN_LOAD = "Design Load"
IDS_EC_FOUNDATION_SERVICE_LOAD = "Service Load"
IDS_EC_FOUNDATION_FACTORED_LOAD = "Factored Load"
IDS_EC_FOUNDATION_SURCHARGE_LOAD = "Surcharge Load"
IDS_EC_FOUNDATION_SURFACE_LOAD = "Surface Load"
IDS_EC_FOUNDATION_WEIGHT_DENSITY = "Weight Density"
IDS_EC_FOUNDATION_SOIL_HEIGHT = "Soil Height"
IDS_EC_FOUNDATION_SELF_WEIGHT_CONSIDERED = "Self weight is considered."
IDS_EC_FOUNDATION_SELF_WEIGHT_NOT_CONSIDERED = "Self weight is not considered."
IDS_EC_FOUNDATION_DEPTH = "Depth"
IDS_EC_FOUNDATION_COLUMN_SECTION = "Column Section"
IDS_EC_FOUNDATION_SHAPE_COLUMN = "Shape of Column"
IDS_EC_FOUNDATION_RECTANGLE = "Rectangle"
IDS_EC_FOUNDATION_CIRCLE = "Circle"
IDS_EC_FOUNDATION_ECCENTRICITY_X = "Eccentricity (X)"
IDS_EC_FOUNDATION_ECCENTRICITY_Y = "Eccentricity (Y)"
IDS_EC_FOUNDATION_WALL_SECTION = "Wall Section"
IDS_EC_FOUNDATION_THICKNESS = "Thickness"
IDS_EC_FOUNDATION_ECCENTRICITY = "Eccentricity"
IDS_EC_FOUNDATION_REBAR = "Rebar"
IDS_EC_FOUNDATION_DIRECTION_X = "Direction X"
IDS_EC_FOUNDATION_LAYER__i = "Layer %i"
IDS_EC_FOUNDATION_DIRECTION_Y = "Direction Y"
IDS_EC_FOUNDATION_FOUNDATION = "Foundation"
IDS_EC_FOUNDATION_FOUNDATION_SIZE = "Foundation Size"
IDS_EC_FOUNDATION_WIDTH = "Width"
IDS_EC_FOUNDATION_NO_OF_PILE = "No. of pile "
IDS_EC_FOUNDATION_SPACE_OF_PILE = "Space of pile "
IDS_EC_FOUNDATION_CHECK_SOIL_CAPA = "Check Soil Capacity"
IDS_EC_FOUNDATION_CHECK_SOIL_STRESS = "Check service soil stress in main program."
IDS_EC_FOUNDATION_CALC_SOIL_STRESS = "Calculate service soil stress"
IDS_EC_FOUNDATION_CALC_FACTORED_SOIL_STRESS = "Calculate ultimate soil stress"
IDS_EC_FOUNDATION_CALC_SOIL_STRESS__s = "Calculate service soil stress (%s)"
IDS_EC_FOUNDATION_CALC_FACTORED_SOIL_STRESS__s = "Calculate ultimate soil stress (%s)"
IDS_EC_FOUNDATION_CHECK_PILE_CAPA = "Check Pile Capacity"
IDS_EC_FOUNDATION_CALC_ACTUAL_PILE_STRESS__s = "Calculate service pile reaction (%s)"
IDS_EC_FOUNDATION_CALC_FACTORED_PILE_STRESS__s = "Calculate ultimate pile reaction (%s)"
IDS_EC_FOUNDATION_INDEX = "Index"
IDS_EC_FOUNDATION_AT_FACE = "at Face"
IDS_EC_FOUNDATION_AT_DIST2D = "at Distance-2D"
IDS_EC_FOUNDATION_CHECK_ONE_WAY_SHEAR = "Check One-Way Shear"
IDS_EC_FOUNDATION_CHECK_TWO_WAY_SHEAR = "Check Two-Way Shear"
IDS_EC_FOUNDATION_CALC_PAREMETER = "Calculate parameter"
IDS_EC_FOUNDATION_COLUMN_FACE = "Calculate Shear at Face of Column"
IDS_EC_FOUNDATION_2D = "Calculate Shear at Distance-2d"
IDS_EC_FOUNDATION_D = "Calculate Shear at Distance-d"
IDS_EC_FOUNDATION_CHECK_MOMENT_CAPA = "Check Moment Capacity"
IDS_EC_FOUNDATION_CALC_MOMENT_CAPA__s = "Calculate moment capacity (%s)"
IDS_EC_FOUNDATION_CALC_MOMENT_CAPA_AT_COLM_FACE = "Calculate moment capacity at the column face"
IDS_EC_FOUNDATION_REF_095D = "Reference of 0.95d is 'The Concise Eurocode' 2006"
IDS_EC_FOUNDATION_CHECK_REBAR = "Check Rebar"
IDS_EC_FOUNDATION_CALC_MINIMUM_REBAR_AREA_REQ = "Calculate minimum rebar area required"
IDS_EC_FOUNDATION_X_DIRECTION = "X Direction"
IDS_EC_FOUNDATION_Y_DIRECTION = "Y Direction"
IDS_EC_FOUNDATION_CALC_MINIMUM_REBAR_SPACE_REQ__s = "Calculate maximum rebar spacing limit (%s)"
IDS_EC_FOUNDATION_SELF_WEIGHT = "Self Weight"
IDS_EC_FOUNDATION_COLUMN = "Column"
IDS_EC_FOUNDATION_SHAPE = "Shape"
IDS_EC_FOUNDATION_DIAMETER = "Diameter"
IDS_EC_FOUNDATION_ECCENT_X = "Eccentricity(X)"
IDS_EC_FOUNDATION_ECCENT_Y = "Eccentricity(Y)"
IDS_EC_FOUNDATION_WALL = "Wall"
IDS_EC_FOUNDATION_LAYER_1_X = "Layer-1 (X)"
IDS_EC_FOUNDATION_LAYER_2_X = "Layer-2 (X)"
IDS_EC_FOUNDATION_LAYER_1_Y = "Layer-1 (Y)"
IDS_EC_FOUNDATION_LAYER_2_Y = "Layer-2 (Y)"
IDS_EC_FOUNDATION_PILE = "Pile"
IDS_EC_FOUNDATION_SPACE = "Space"
IDS_EC_FOUNDATION_CHECK_CAPA = "Check Capacity"
IDS_EC_FOUNDATION_CHECK_ITEMS = "Check Items"
IDS_EC_FOUNDATION_UNIT = "Unit"
IDS_EC_FOUNDATION_CALCULATED = "Calculated"
IDS_EC_FOUNDATION_CRITIERIA = "Criteria"
IDS_EC_FOUNDATION_SOIL_CAPA__s = "Soil Capacity (%s)"
IDS_EC_FOUNDATION_MOMENT_X_DIR_MUY__s = "Moment-X Direction(Muy, %s)"
IDS_EC_FOUNDATION_MOMENT_Y_DIR_MUX__s = "Moment-Y Direction(Mux, %s)"
IDS_EC_FOUNDATION_ONE_WAY_SHEAR_X__s = "1Way Shear-X (%s)"
IDS_EC_FOUNDATION_ONE_WAY_SHEAR_Y__s = "1Way Shear-Y (%s)"
IDS_EC_FOUNDATION_TWO_WAY_SHEAR__s = "2Way Shear (%s)"
IDS_EC_FOUNDATION_TWO_WAY_SHEAR_FACE_s = "2Way Shear-Face (%s)"
IDS_EC_FOUNDATION_TWO_WAY_SHEAR_2D_s = "2Way Shear-2D (%s)"
IDS_EC_FOUNDATION_TWO_WAY_SHEAR_D_s = "2Way Shear-D (%s)"
IDS_EC_FOUNDATION_PILEPUNCHING_FACE_s = "Pile Punching-Face (%s)"
IDS_EC_FOUNDATION_PILEPUNCHING_2D_s = "Pile Punching-2D (%s)"
IDS_EC_FOUNDATION_PILE_CAPA_COMP__s = "Pile Capacity-Comp. (%s)"
IDS_EC_FOUNDATION_PILE_CAPA_TENS__s = "Pile Capacity-Tens. (%s)"
IDS_EC_FOUNDATION_FOUNDATION_INPUT_LIST = "FOUNDATION INPUT LIST"
IDS_EC_FOUNDATION_INPUT_DATA_LIST = "Input Data List"
IDS_EC_FOUNDATION_DEPTH_COVER__s__s__s__s = "Depth = %s%s, Cover = %s%s"
IDS_EC_FOUNDATION_DEPTH_DISTANCE__s__s__s__s = "Depth = %s%s, Distance = %s%s"
IDS_EC_FOUNDATION_GENERATING_FOUNDATION_REPORT = "Generating Foundation Report..."
IDS_EC_FOUNDATION_SHAPE_COLUMN_RECTANGLE = "Shape of Column \t: Rectangle"
IDS_EC_FOUNDATION_SHAPE_COLUMN_CIRCLE = "Shape of Column \t: Circle"
IDS_EC_FOUNDATION_ECCENT_X__s__s = "Eccentricity (X) \t: %s%s"
IDS_EC_FOUNDATION_ECCENT_Y__s__s = "Eccentricity (Y) \t: %s%s"
IDS_EC_FOUNDATION_THICKNESS__s = "Thickness \t: %s"
IDS_EC_FOUNDATION_ECCENT__s = "Eccentricity \t: %s"
IDS_EC_FOUNDATION_WIDTH__s__s = "Width \t: %s%s"
IDS_EC_FOUNDATION_X__s = "X(%s)"
IDS_EC_FOUNDATION_Y__s = "Y(%s)"
IDS_EC_FOUNDATION_PILE_PUNCHING = " : Pile Punching"
IDS_EC_FOUNDATION_CALC_ONE_WAY_SHEAR_DIR_X = "Calculate one-way shear (Direction X)"
IDS_EC_FOUNDATION_CALC_ONE_WAY_SHEAR_DIR_Y = "Calculate one-way shear (Direction Y)"
IDS_EC_FOUNDATION_CHECK_MOMENT = "Check Moment"
IDS_EC_FOUNDATION_COLUMN__s = "Column (%s)"
IDS_EC_FOUNDATION_WALL__s = "Wall (%s)"
IDS_EC_FOUNDATION_DEPTH_COVER_DIVIDE__s__s__s__s = "( Depth = %s%s, Cover = %s%s / "
IDS_EC_FOUNDATION_DEPTH_DISTANCE_DIVIDE__s__s__s__s = "( Depth = %s%s, Distance = %s%s / "
IDS_EC_FOUNDATION_FCK_FY__s__s = "fck = %s%s, fyk = %s%s )"
IDS_EC_FOUNDATION_SELF_ENTER_WEIGHT = "Self\nWeight"
IDS_EC_FOUNDATION_ISNOT_ADJUST_DGN_MODULE = "Incompatible version of the design module"
IDS_EC_FOUNDATION_FCK_FY__s__s__s__s = "fck = %s%s, fyk = %s%s"
IDS_EC_FOUNDATION_MOMENT_EFFECTIVE_DEPTH = "Calculate Moment Effective Depth"
IDS_EC_FOUNDATION_SHEAR_EFFECTIVE_DEPTH = "Calculate Shear Effective Depth"
IDS_EC_FOUNDATION_PILE_PUNCHING_NOTE1 = "Note : When checking pile punching, it is assumed that the pile is an internal pile."
IDS_EC_FOUNDATION_PILE_PUNCHING_NOTE2 = "Critical perimeter is determined without the consideration of corner pile or edge pile."
IDS_EC_FOUNDATION_USER_D = "Calculate Shear at Distance-User d"
IDS_EC_ONEWAY_SHEAR = "One Way Shear"
IDS_EC_ONEWAY_SHEAR_X = "One Way Shear-X"
IDS_EC_TWOWAY_SHEAR = "Two Way Shear"
IDS_EC_TWOWAY_SHEAR_CF = "Two Way Shear-Column Face"
IDS_EC_TWOWAY_SHEAR_2D = "Two Way Shear-2D"
IDS_EC_TWOWAY_SHEAR_USERD = "Two Way Shear-UserD"
IDS_EC_OFFSET_FACTOR = "Offset Factor"
IDS_EC_MOMENT_Y_DIRECTION = "Moment-Y Direction"
IDS_EC_MOMENT_X_DIRECTION = "Moment-X Direction"
IDS_EC_CANTIL_MOMENT_X_DIRECTION = "Moment-X Direction( Cantilever ) "
IDS_EC_COLUMN_MOMENT_X_DIRECTION = "Moment-X Direction( Column ) "
IDS_EC_SPAN_MOMENT_X_DIRECTION = "Moment-X Direction( Span ) "
IDS_EC_REBAR_SPACE_Y_DIRECTION = "Check Space-Y"
IDS_EC_REBAR_SPACE_X_DIRECTION = "Check Space-X"
IDS_EC_REBAR_AREA_Y_DIRECTION = "Check Area-Y"
IDS_EC_REBAR_AREA_X_DIRECTION = "Check Area-X"
IDS_EC_OFFSET = "Offset"
IDS_EC_FOUNDATION_SOIL_CAPA = "Soil Capacity"
IDS_EC_FOUNDATION_SOIL_CAPA_EXPL = "The value is based on service load"
IDS_EC_FOUNDATION_OVER_TURNING = "Values will not be displayed, if overturning occurs"
IDS_EC_FOUNDATION_SOIL_DIAGRM = "Soil Stress Diagram"
IDS_EC_SFD_DIAGRAM = "Shear Force Diagram"
IDS_EC_BMD_DIAGRAM = "Bending Moment Diagram"
IDS_EC_PLAN_SECT = "Plan & Section"
IDS_EC_REBAR_MAX_AREA = "Maximum Area"
IDS_EC_REBAR_MIN_AREA = "Minimum Area"
IDS_EC_REBAR_REQ_AREA = "Required Area"
IDS_EC_REBAR_MAX_SPACE = "Maximum Space"
IDS_EC_CANTIL = "Cantilever"
IDS_EC_COLUMN = "Column"
IDS_EC_SPAN = "Span"
IDS_EC_FOUNDATION_FDN_SECTION = "Foundation Section"
IDS_EC_FOUNDATION_FORCES_REINFORCEMENT = "Forces and Reinforcement"
IDS_EC_FOUNDATION_INVERTED_T = "Inverted T"
IDS_EC_FOUNDATION_ECC = "Ecc."
IDS_EC_FOUNDATION_MOMENT_TOP__s = "Moment_top (%s)"
IDS_EC_FOUNDATION_MOMENT_BOT__s = "Moment_bot (%s)"
IDS_EC_FOUNDATION_SHEAR__s = "Shear (%s)"
IDS_EC_FOUNDATION_TRANSE_MOMENT__s = "Transverse Moment (%s)"
IDS_EC_FOUNDATION_LX = "Lx"
IDS_EC_FOUNDATION_SECTION_BEAM_SIZE = "Beam Size"
IDS_EC_FOUNDATION_MOMENTS_FORCES = "Moments and Forces"
IDS_EC_FOUNDATION_CALC_SHEAR_CAPA = "Calculate Shear capacity"
IDS_EC_FOUNDATION_FCK_FY_NOBRACKET__s__s = "fck = %s%s, fyk = %s%s"
IDS_EC_FOUNDATION_TOP_BAR = "Top Bar"
IDS_EC_FOUNDATION_BOTTOM_BAR = "Bottom Bar"
IDS_EC_FOUNDATION_BOT_BAR = "Bot Bar"
IDS_EC_FOUNDATION_STIRRUP = "Stirrup"
IDS_EC_FOUNDATION_STANSVERSE_BAR = "Transverse Rebar"
IDS_EC_FOUNDATION_STANS_BAR = "Trans. Bar"
IDS_EC_FOUNDATION_X = "X"
IDS_EC_FOUNDATION_Y = "Y"
IDS_EC_FOUNDATION_DIR_x = "x"
IDS_EC_FOUNDATION_DIR_y = "y"
IDS_EC_FOUNDATION__s_c = "%s_c$"
IDS_EC_FOUNDATION__s_s = "%s_s$"
IDS_EC_FOUNDATION_Fck = "f_ck$"
IDS_EC_FOUNDATION_Fy = "f_yk$"
IDS_EC_FOUNDATION_Ps = "P_Ed,s$"
IDS_EC_FOUNDATION_Msx = "M_Edx,s$"
IDS_EC_FOUNDATION_Msy = "M_Edy,s$"
IDS_EC_FOUNDATION_Pu = "N_Ed$"
IDS_EC_FOUNDATION_Mux = "M_Edx$"
IDS_EC_FOUNDATION_Muy = "M_Edy$"
IDS_EC_FOUNDATION_Mu_top = "M_Ed,top$"
IDS_EC_FOUNDATION_Mu_bottom = "M_Ed,bottom$"
IDS_EC_FOUNDATION_Mu_bot = "M_Ed,bot$"
IDS_EC_FOUNDATION_As = "A_s$"
IDS_EC_FOUNDATION_REBAR__s__s = "%s@%s"
IDS_EC_FOUNDATION_L_x = "L_x$"
IDS_EC_FOUNDATION_L_y = "L_y$"
IDS_EC_FOUNDATION_fe = "f_e$"
IDS_EC_FOUNDATION_EA = "EA"
IDS_EC_FOUNDATION_q_a_comp = "q_a,comp.$"
IDS_EC_FOUNDATION_q_a_tens = "q_a,tens.$"
IDS_EC_FOUNDATION_q_a = "q_a$"
IDS_EC_FOUNDATION_q_s_left = "q_s,left$"
IDS_EC_FOUNDATION_q_s_right = "q_s,right$"
IDS_EC_FOUNDATION_q_s_top_left = "q_s,top-left$"
IDS_EC_FOUNDATION_q_s_top_right = "q_s,top-right$"
IDS_EC_FOUNDATION_q_s_bot_left = "q_s,bot-left$"
IDS_EC_FOUNDATION_q_s_bot_right = "q_s,bot-right$"
IDS_EC_FOUNDATION_q_s_max = "q_s,max$"
IDS_EC_FOUNDATION_q_s_min = "q_s,min$"
IDS_EC_FOUNDATION_q_s = "q_s$"
IDS_EC_FOUNDATION_q_u_left = "q_u,left$"
IDS_EC_FOUNDATION_q_u_right = "q_u,right$"
IDS_EC_FOUNDATION_q_u_top_left = "q_u,top-left$"
IDS_EC_FOUNDATION_q_u_top_right = "q_u,top-right$"
IDS_EC_FOUNDATION_q_u_bot_left = "q_u,bot-left$"
IDS_EC_FOUNDATION_q_u_bot_right = "q_u,bot-right$"
IDS_EC_FOUNDATION_q_u_max = "q_u,max$"
IDS_EC_FOUNDATION_q_u_min = "q_u,min$"
IDS_EC_FOUNDATION_q_u = "q_u$"
IDS_EC_FOUNDATION_V_Ed = "V_Ed$"
IDS_EC_FOUNDATION_V_Edx = "V_Edx$"
IDS_EC_FOUNDATION_V_Edy = "V_Edy$"
IDS_EC_FOUNDATION_M_Ed__s = "M_Ed%s$"
IDS_EC_FOUNDATION_Ed = "_Ed$"
IDS_EC_FOUNDATION_V_Rd = "V_Rd$"
IDS_EC_FOUNDATION_V_Rdx = "V_Rdx$"
IDS_EC_FOUNDATION_V_Rdy = "V_Rdy$"
IDS_EC_FOUNDATION_M_Rd__s = "M_Rd%s$"
IDS_EC_FOUNDATION_Rd = "_Rd$"
IDS_EC_FOUNDATION_Rdmax = "_Rdmax$"
IDS_EC_FOUNDATION_As_min = "A_s,min$"
IDS_EC_FOUNDATION_APP_As_min = "Applied A_s,min$"
IDS_EC_FOUNDATION_s_req = "s_req$"
IDS_EC_FOUNDATION_s_req1 = "s_req.1$"
IDS_EC_FOUNDATION_s_req2 = "s_req.2$"
IDS_EC_FOUNDATION_s__s = "s_%s$"
IDS_EC_FOUNDATION_L_SELF_WEIGHT = "Self\nWeight"
IDS_EC_FOUNDATION_L_SURFACE = "L_surface$"
IDS_EC_FOUNDATION_H_SOIL = "H_soil$"
IDS_EC_FOUNDATION_C_x = "C_x$"
IDS_EC_FOUNDATION_C_y = "C_y$"
IDS_EC_FOUNDATION_Ecc_x = "Ecc_x$"
IDS_EC_FOUNDATION_Ecc_y = "Ecc_y$"
IDS_EC_FOUNDATION_TOP = "Top"
IDS_EC_FOUNDATION_BOT = "Bot"
IDS_EC_FOUNDATION_LAYER__i__EA = "Layer %i\t : %i EA ("
IDS_EC_FOUNDATION_STRIRRUP__s = "Stirrup \t : %s ("
IDS_EC_FOUNDATION_TRANS_BAR__s__s = "Transverse Rebar \t : %s-%s ("
IDS_EC_FOUNDATION_SURCHARGE_LOAD_NOT = "Surcharge Load is not considered."
IDS_EC_FOUNDATION_FOR_UNIT_WIDTH = "for the unit width"
IDS_EC_FOUNDATION_FOR_WHOLE_WIDTH = "for the whole width"
IDS_EC_MEMBER_NAME = "MEMBER NAME"
IDS_EC_GENERAL_INFORMATION = "General Information"
IDS_EC_DESIGN_CODE = "Design Code"
IDS_EC_UNIT_SYSTEM = "Unit System"
IDS_EC_SECTION = "Section"
IDS_EC_SECTION_SIZE = "Section Size"
IDS_EC_SECTION_SHAPE_T = "T-Section"
IDS_EC_SECTION_SHAPE_RECT = "R-Section"
IDS_EC_THICKNESS = "Thickness"
IDS_EC_MATERIAL = "Material"
IDS_EC_REBAR_COVER = "Cover"
IDS_EC_REBAR_DISTANCE = "Distance"
IDS_EC_CONSIDERED = "Considered"
IDS_EC_NOT_CONSIDERED = "Not Considered"
IDS_EC_POSITION_CAPITAL = "POSITION"
IDS_EC_POS = "POS"
IDS_EC_DESIGN_FORCES = "Design Forces"
IDS_EC_FORCES = "Forces"
IDS_EC_BY_LOAD_COMB = "by Load Combinations"
IDS_EC_SURCHARGE_LOAD_SELF_WEIGHT = "Surcharge Load & Self Weight"
IDS_EC_REINFORCEMENT = "Reinforcement"
IDS_EC_TOP_BAR = "Top Bar"
IDS_EC_BOTTOM_BAR = "Bottom Bar"
IDS_EC_TOP = "Top"
IDS_EC_BOTTOM = "Bottom"
IDS_EC_EXT_BAR = "Ext. Bar"
IDS_EC_INT_BAR = "Int. Bar"
IDS_EC_BOT = "Bot."
IDS_EC_EXT = "Ext."
IDS_EC_INT = "Int."
IDS_EC_STIRRUP = "Stirrup"
IDS_EC_TRANSVERSE_BAR = "Transverse Bar"
IDS_EC_POSITION_I = "I"
IDS_EC_POSITION_M = "M"
IDS_EC_POSITION_J = "J"
IDS_EC_RATIO = "Ratio"
IDS_EC_LAYER = "Layer"
IDS_EC_REMARK = "Remark"
IDS_EC_ITEMS = "Items"
IDS_EC_VALUE = "Value"
IDS_EC_INPUT_DATA_LIST = "Input Data List"
IDS_EC_LENGTH = "Length"
IDS_EC_FACTOR = "Factor"
IDS_EC2_BEAM_GENERATE_REPORT = "Generating RC/Beam Report..."
IDS_EC2_BEAM_MOMENT_FORCES = "Moments and Forces"
IDS_EC2_BEAM_FORCE_REINFORCEMENT = "Forces and Reinforcements"
IDS_EC2_BEAM_COMPRESSION_REBAR = "Compression Rebar"
IDS_EC2_BEAM_SPLICE_TYPE = "Splice Type"
IDS_EC2_BEAM_REPORT_CALC_SHEAR_RATIO = "Calculate ratio of shear capacity"
IDS_EC2_BEAM_REPORT_CALC_STIRRUP_SPACE = "Calculate space of shear reinforcement"
IDS_EC2_BEAM_REPORT_CALC_VRD_S = "Calculate shear strength with shear reinforcement"
IDS_EC2_BEAM_REPORT_CALC_VRD_MAX = "Calculate maximum shear capacity of the section"
IDS_EC2_BEAM_CHECK_ONEWAY_SHEAR = "Check One-way Shear"
IDS_EC2_BEAM_CHECK_MOMENT_CAPACITY = "Check Bending Moment Capacity"
IDS_EC2_BEAM_CALC_MATL_DGN_STRENGTH = "Calculate design strength of materials"
IDS_EC2_BEAM_CALC_DGN_PARAM = "Calculate design parameter"
IDS_EC2_BEAM_CALC_REQ_REBAR_AREA = "Calculate required area of reinforcement"
IDS_EC2_BEAM_CALC_LIMIT_REBAR_AREA = "Calculate limit of reinforcement area"
IDS_EC2_BEAM_CHECK_TENS_REBAR_AREA = "Check area of tensile reinforcement"
IDS_EC2_BEAM_CALC_MOMENT_CAPACITY = "Calculate moment capacity"
IDS_EC2_BEAM_CALC_MOMENT_RATIO = "Calculate ratio of moment capacity"
IDS_EC2_BEAM_SKIP_MOMENT_ZERO = "Moment is zero. Skipped"
IDS_EC2_BEAM_CHECK_SHEAR_CAPACITY = "Check Shear Capacity"
IDS_EC2_BEAM_CALC_SHEAR_CAPACITY_CONC = "Calculate shear strength without shear reinforcement"
IDS_EC2_BEAM_REBAR_POSITIVE = "Positive"
IDS_EC2_BEAM_REBAR_NEGATIVE = "Negative"
IDS_EC2_BEAM_REBAR_POSITIVE_INT = "Positive, Int."
IDS_EC2_BEAM_REBAR_NEGATIVE_EXT = "Negative, Ext."
IDS_EC2_BEAM_SLAB_THICKNESS = "Slab Thickness"
IDS_EC2_BEAM_EFFECTIVE_WIDTH = "Effective Width"
IDS_EC2_BEAM_INPUT_LIST_TITLE = "BEAM INPUT LIST"
IDS_EC2_ANALYSIS_AS_RECTANGLE_BEAM = "Analyze as Rectangular beam"
IDS_EC2_ANALYSIS_AS_TEE_BEAM = "Analyze as Tee-beam"
IDS_EC2_DO_NOT_CHK_CRACK_WIDTH = "Do not check crack width"
IDS_EC2_CRACK_LIMIT = "Crack Limit"
IDS_EC2_CHK_CRACK_WIDTH = "Check Crack Width"
IDS_EC2_CHK_CRACK_WIDTH_FACTORS = "Crack Width Factors"
IDS_EC2_CHK_CRACK_OF_CHARACTERISTIC_LOAD = "Check Crack of Characteristic Load"
IDS_EC2_CHK_CRACK_OF_QUASI_LOAD = "Check Crack of Quasi-Permanent Load"
IDS_EC2_CHK_CRACK_OF_FREQUENT_LOAD = "Check Crack of Frequent Load"
IDS_EC2_EXPOSURE_CLASS = "Exposure Class"
IDS_EC2_CHECK_STRESS_LIMITATION = "Check stress limit"
IDS_EC2_CRITERIA_DEFLECTION = "Criteria for deflection"
IDS_EC2_FOR_CHARACTERISTIC_DEFLECTION = "For Characteristic Load deflection"
IDS_EC2_FOR_QUASI_PERMANENT_DEFLECTION = "For Quasi-Permanent Load deflection"
IDS_EC2_DEFLECTION_AMPLIFICATION_FACTOR = "Deflection Amplification Factor"
IDS_EC2_DEFLECTION = "Deflection"
IDS_EC2_DIVIEDED_BY2_CANTILEVER = "Divided by 2 for Cantilever"
IDS_EC2_SUPPORT = "Support"
IDS_EC2_SPAN = "Span"
IDS_EC2_CHARACTERISTIC = "Characteristic"
IDS_EC2_QUASI_PERMANENT = "Quasi-Permanent"
IDS_EC2_FREQUENT = "Frequent"
IDS_EC2_DURATION = "Duration"
IDS_EC_DEAD = "Dead"
IDS_EC_DEAD_LOAD = "Dead Load"
IDS_EC_LIVE = "Live"
IDS_EC_LIVE_LOAD = "Live Load"
IDS_EC_SECT_DOT_UCASE = "SECT."
IDS_EC2_CHARACTERISTIC_DEFLECTION = "Characteristic Deflection"
IDS_EC2_QUASI_PERMANENT_DEFLECTION = "Quasi-Permanent Deflection"
IDS_EC2_CHECK_DEFLECTION = "Check Deflection"
IDS_EC_SUPPORT_CONDITION = "Support Condition"
IDS_EC_CHARACTERISTIC_DEFLECTION_FACTOR = "Characteristic Deflection Factor"
IDS_EC_QUASI_DEFLECTION_FACTOR = "Quasi-Permanent Deflection Factor"
IDS_EC_DURATION_FOR_SUSTAIN_LOAD = "Duration for sustained load"
IDS_EC_SUSTAIN_LOAD = "Sustained Load"
IDS_EC2_CBSF_MAIN_RIB = "Main Rib"
IDS_EC2_CBSF_FLANGE_PART = "Flange Part"
IDS_EC2_CBSF_CALC_FORCE_FLANGE_PART = "Calculate Design Force (Flange Part)"
IDS_EC2_CBSF_FORCE_PARAM_FLANGE_PART = "Design Force Parameter"
IDS_EC2_CBSF_FORCE_FLANGE_PART = "Design Force (Flange Part)"
IDS_EC2_CBSF_SOIL_BEARING_CAPACITY = "Soil Bearing Capacity"
IDS_EC2_CBSF_CHECK_SOIL_BEARING_CAPACITY = "Check Soil Bearing Capacity"
IDS_EC2_CBSF_CALC_SOIL_BEARING_RATIO = "Calculate ratio of soil capacity"
IDS_EC2_CBSF_INPUT_LIST_TITLE = "CONTINUOUS BEAM STRIP FOOTING INPUT LIST"
IDS_EC2_CBSF_GENERATING_CBSF_REPORT = "Generating Strip Foundation Report..."
IDS_EC_FOUNDATION_MOMENT_X_DIR_MEDY__s = "Moment-X Direction(MEdy, %s)"
IDS_EC_FOUNDATION_MOMENT_Y_DIR_MEDX__s = "Moment-Y Direction(MEdx, %s)"
IDS_EC2_CWALL_INPUT_LIST_TITLE = "COMBINED WALL INPUT LIST"
IDS_EC2_CWALL_GENERATING_CWALL_REPORT = "Generating Combined Wall Report..."
IDS_EC2_CWALL_WALL_ID = "Wall ID"
IDS_EC_LOAD_COMBINATIONS = "Load Combinations"
IDS_EC_LCB = "LCB"
IDS_EC2_CWALL_START_POINT = "Start Point"
IDS_EC2_CWALL_END_POINT = "End Point"
IDS_EC_INFORMATION = "Information"
IDS_EC_SPACING_LIMIT = "Spacing Limit"
IDS_EC2_CWALL_VERT_REBAR_POSITION = "Vertical Rebar Position"
IDS_EC2_CWALL_VERT_REBAR = "Vert. Rebar"
IDS_EC2_CWALL_HORZ_REBAR = "Hori. Rebar"
IDS_EC2_CWALL_END_REBAR = "End Rebar"
IDS_EC2_CWALL_REBAR_ARRANGEMENT = "Arrangement"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_DIVIDE_EQUALLY = "Divide equally by nearest space"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_DIVIDE_EXACT = "Divide by exact space"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_FROM_END = "From End"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_FROM_MID = "From Middle"
IDS_EC2_CWALL_REBAR_ARRANGEMENT_ADD_REBAR = "Add Bar"
IDS_EC_CHECK_SLENDERNESS_RATIO = "Check Slenderness Ratio"
IDS_EC_CALC_RADIUS_GYRATION = "Calculate radius of gyration"
IDS_EC_CALC_SLENDERNESS_RATIO = "Calculate slenderness ratio"
IDS_EC_CALC_SLENDERNESS_RATIO_LIMIT = "Calculate limiting slenderness ratio"
IDS_EC_SLENDER = "Slender"
IDS_EC_NOT_SLENDER = "Not Slender"
IDS_EC_CHECK_MIN_MOMENT = "Check Minimum Moment"
IDS_EC_CALC_MIN_MOMENT = "Calculate Minimum Moment"
IDS_EC_CALC_MIN_ECCEN = "Calculate Minimum Eccentricity"
IDS_EC_CHECK_DESIGN_MOMENT = "Check Design Moment"
IDS_EC_CALC_DESIGN_MOMENT = "Calculate Design Moment"
IDS_EC_DESIGN_MOMENT = "Design Moment"
IDS_EC_X_DIRECTION = "X Direction"
IDS_EC_Y_DIRECTION = "Y Direction"
IDS_EC_CHECK_DESIGN_PARAMETER = "Check Design Parameter"
IDS_EC_CALC_REBAR_RATIO = "Calculate Rebar Ratio"
IDS_EC_CALC_ECCENTRICITY = "Calculate Eccentricity"
IDS_EC_ROTATION_NA = "Rotation angle of neutral axis"
IDS_EC_CALC_CONCEN_AXIAL_CAPACITY = "Calculate concentric axial load capacity"
IDS_EC_CHECK_MOMENT_CAPACITY = "Check Moment Capacity"
IDS_EC_CALC_CAPACITY_CONCRETE = "Calculate capacity of compression stress block"
IDS_EC_CALC_CAPACITY_REBAR = "Calculate capacity of rebar"
IDS_EC_CALC_NORMINAL_CAPACITY_FOR_NA = "Calculate nominal capacity for neutral axis"
IDS_EC_CALC_AXIAL_MOMENT_CAPACITY = "Calculate axial load and moment capacities"
IDS_EC_CHECK_SHEAR_CAPACITY = "Check Shear Capacity"
IDS_EC_CALC_STIRRUP_MAX_SPACE = "Calculate maximum space"
IDS_EC_CALC_SHEAR_STRENGTH = "Calculate shear strength"
IDS_EC_LENGTH_FACTOR = "Length & Factor"
IDS_EC_MOMENT_CAPACITY = "Moment Capacity"
IDS_EC_SHEAR_CAPACITY = "Shear Capacity"
IDS_EC_CHECK_ITEM = "Check Item"
IDS_EC_NO = "No"
IDS_EC_CHK = "CHK"
IDS_EC_NAME = "Name"
IDS_EC_DESCRIPTION = "Description"
IDS_EC_DESIGN_FORCE = "Design Force"
IDS_EC2_CWALL_FLANGE_WIDTH = "Flange Width"
IDS_EC2_CWALL_FLANGE_WIDTH_ACTUAL = "Actual Width"
IDS_EC2_CWALL_FLANGE_WIDTH_EFFECT = "Effective Width"
IDS_EC2_CWALL_GLOBAL = "Global"
IDS_EC_SHEAR_REINFORCEMENT_NOT_REQUIRED = "Shear reinforcement is not required."
IDS_EC_SHEAR_REINFORCEMENT_REQUIRED = "Shear reinforcement is required."
IDS_EC_2ND_ORDER_EFFECT = "2nd Order Effects"
IDS_EC_IMPERFECTION = "Imperfection"
IDS_EC_AUTO_CALC = "Auto Calc."
IDS_ERCO_MOMENT_CAPACITY = "Check Moment Capacity"
IDS_ERCO_NOMINAL_CAPACITY_BALANCED = "Calculate nominal capacity for balaced axis"
IDS_ERCO_NOMINAL_CAPACITY_FOR_NEUTRAL_AXIS = "Calculate nominal capacity for neutral axis"
IDS_ERCO_BANLANCED_AXIS = "Balanced axis"
IDS_ERCO_NEUTRAL_AXIS = "Neutral axis"
IDS_ERCO_CAPACITY_REBAR = "Calculate capacity of rebar"
IDS_ERCO_CAPACITY_COMPRESSION_BLOCK = "Calculate capacity of compression stress block"
IDS_CALC_STRENGTH_REDUCTION_FACTOR = "Calculate strength redection factor"
IDS_EC_ERCO_GENERATE_REPORT = "Generating RC Column Report..."
IDS_EC_ERCO_CHK_SERVICEABILITY = "Check Serviceability"
IDS_EC_ERCO_SERVICEABILITY_FACTORS = "Serviceability Factors"
IDS_EC_ERCO_CHK_CHARACTERISTIC_LOAD_STRESS_OF_CONC = "Check Characteristic Load ( Stress of Concrete )"
IDS_EC_ERCO_CHK_QUASI_LOAD_LINEAR_CREEP = "Check Quasi-Permanent Load ( Linear Creep )"
IDS_EC_ERCO_CHK_FREQUENT_LOAD_STRESS_OF_CONC = "Check Frequent Load ( Stress of Concrete )"
IDS_EC_ERCO_CRACKED_SECTION = "Cracked Section"
IDS_EC_ERCO_UNCRACKED_SECTION = "Uncracked Section"
IDS_EC_ERCO_LINEAR_CREEP = "Linear Creep"
IDS_EC_ERCO_NONLINEAR_CREEP = "Nonlinear Creep"
IDS_EC_ERCO_LONG_TERM = "Long Term"
IDS_EC_ERCO_SHORT_TERM = "Short Term"
IDS_URGC_EFFECTIVE_AREA = "Effective Area"
IDS_URGC_GENERATE_REPORT = "Generating RC General Section Column Report..."
IDS_URGC_GEN_COLUMN_INPUT_LIST = "RC GENERAL SECTION COLUMN INPUT LIST"
IDS_ESBC_INPUT_LIST = "STEEL BOLT CONNECTION INPUT LIST"
IDS_ESBC_PLATE = "Plate"
IDS_ESBC_PLATE_WEB = "Plate (Web)"
IDS_ESBC_PLATE_FLANGE = "Plate (Flange)"
IDS_ESBC_BOLT = "Bolt"
IDS_ESBC_EXTENSION = "Extension"
IDS_ESBC_AUTO = "Auto"
IDS_ESBC_SUPPORTED_MEM = "Supported Member"
IDS_ESBC_SUPPORTING_MEM = "Supporting Member"
IDS_ESBC_BOLT_TYPE = "Bolt Type"
IDS_ESBC_WELDING = "Welding"
IDS_ESBC_WELDING_MATERIAL_AND_LEG = "Material and Leg"
IDS_ESBC_WELDING_MATERIAL = "Material of welding"
IDS_ESBC_WELDING_LEG = "Leg of welding"
IDS_ESBC_MAX_VALUE = "Max Value"
IDS_ESBC_NOT_CHK = "Not Check"
IDS_ESBC_CHK_MAX_VALUE = "Check maximum spacing and extension value"
IDS_ESBC_NOT_CHK_MAX_VALUE = "Do not maximum spacing and extension value"
IDS_ESBC_LEVEL_AND_GAP = "Level and Gap"
IDS_ESBC_LEVEL = "Level"
IDS_ESBC_GAP = "Gap"
IDS_ESBC_PERCENT = "Percecnt"
IDS_ESBC_APPLY = "Apply"
IDS_ESBC_DIVISION = "Division Plate"
IDS_ESBC_DIVISION_APPLY = "Apply Division Plate"
IDS_ESBC_DIVISION_NOT_APPLY = "Don't Apply Division Plate"
IDS_ESBC_APPLIED_FORCE = "Applied Force"
IDS_ESBC_MEMB_STRENGTH = "Member Strength"
IDS_ESBC_CHK_FLG_COVER_PLATE = "Check Flange Cover Plate"
IDS_ESBC_CHK_NET_TENSION = "Check Presence of net tension"
IDS_ESBC_CHK_NET_TENSION_OCCUR = "Net tension occur"
IDS_ESBC_CHK_NET_TENSION_NOT_OCCUR = "Net tension does not occur"
IDS_ESBC_CHK_PLATE_RESIS = "Check Plate Resistance"
IDS_ESBC_CHK_BOLT_GROUP = "Check Bolt Group"
IDS_ESBC_CHK_MIN_RESIS = "Check Minimum Resistance"
IDS_ESBC_CHK_CHK_COVER_PLATE = "Check Cover plate"
IDS_ESBC_CHK_DIMENSION = "Check Dimension"
IDS_ESBC_CHK_PLATE = "Check Plate"
IDS_ESBC_CHK_FLG_WEB_DIMENSION = "Check Flange & Web Plate Dimension"
IDS_ESBC_CHK_THIK = "Check Thickness"
IDS_ESBC_CHK_SPACING = "Check Spacing"
IDS_ESBC_CHK_PART_BOLT = "Bolt"
IDS_ESBC_CHK_PART_WEB = "Web"
IDS_ESBC_CHK_PART_FLANGE = "Flange"
IDS_ESBC_CHK_PART_PLATE = "Plate"
IDS_ESBC_CHK_PART_COLUMN = "Column"
IDS_ESBC_CHK_PART_CONNECT = "Connection"
IDS_ESBC_CHK_PART_PLATE_FIN = "Fin Plate"
IDS_ESBC_CHK_PART_PLATE_END = "End Plate"
IDS_ESBC_CHK_PART_PLATE_DIV = "Division Plate"
IDS_ESBC_CHK_SUPPORTED_MEM = "Check Supported Member"
IDS_ESBC_CHK_CONNECTION = "Check Connection"
IDS_ESBC_CHK_SUPPORTING_MEM = "Check Supporting Member"
IDS_ESBC_CHK_TYING_RESISTANCE = "Check Tying Resistance"
IDS_ESBC_CHK_STRUCT_INTEGRITY = "Check Structural Integrity "
IDS_ESBC_CHK_SUPPORTED_WELD = "Check Welds of Supported Member"
IDS_ESBC_CHK_SUPPORTED_WEB = "Check Shear Resistace of Web"
IDS_ESBC_CHK_SUPPORTED_RESIS_NOTCH = "Check Resistance at a notch"
IDS_ESBC_CHK_SUPPORTED_LOCAL_STA = "Check Local Stability"
IDS_ESBC_CHK_SUPPORTED_BOLT_GROUP = "Check Bolt Group of Connection"
IDS_ESBC_CHK_SUPPORTED_PLATE_SHEAR = "Check Plate in Shear"
IDS_ESBC_CHK_SUPPORTING_SHEAR_BEARING = "Check Shear and Bearing of Supporting Memeber"
IDS_ESBC_CHK_TYING_PLATE_BOLT = "Check Plate and Bolts"
IDS_ESBC_CHK_TYING_SUPPORTED_WEB = "Check web resistance of Supported Member"
IDS_ESBC_CHK_TYING_WELD = "Check Resistance of Welds"
IDS_ESBC_CHK_TYING_SUPPORTING_COL = "Check web resistance of Supporting Column"
IDS_ESBC_CHK_NO_NEED_LOCAL_STABILITY = "No account need be taken of the local stability of the notched beam"
IDS_ESBC_CHK_NEED_LOCAL_STABILITY = "Need be taken of the local stability of the notched beam"
IDS_ESBC_SHEAR = "Shear"
IDS_ESBC_LOW_SHEAR = "Low Shear"
IDS_ESBC_HIGH_SHEAR = "High Shear"
IDS_ESBC_CHK_SHEAER_BOLT_GROUP = "Check shear of bolt group"
IDS_ESBC_CHK_BOLT_BEARING_PLATE = "Check bolt bearing in plate"
IDS_ESBC_CHK_BOLT_BEARING_WEB = "Check bolt bearing in Supported Member Web"
IDS_ESBC_CHK_SHAER_PLATE = "Check shear of the plate"
IDS_ESBC_CHK_BENADING_PLATE = "Check bending of the plate"
IDS_ESBC_CHK_BUCKLING_PLATE = "Check Lateral Torsional Buckling"
IDS_ESBC_CHK_WEB_SHEAR = "Check web in shear"
IDS_ESBC_CHK_SHEAR_NOTCH = "Check web in shear of notched Supported Member"
IDS_ESBC_CHK_RESIS_CONNEC = "Check resistance at the connection"
IDS_ESBC_CHK_RESIS_NOTCH = "Check resistance at the notch"
IDS_ESBC_CHK_LOCAL_STABILITY = "Check local stability"
IDS_ESBC_CHK_WELDING_SUPPORTING = "Check welding of supporting member"
IDS_ESBC_CHK_SHEAR_N_BENDING = "Check Shear and Bearing"
IDS_ESBC_CHK_PLATE_TENSION = "Check tension resistance of plate"
IDS_ESBC_CHK_PLATE_BOLT_SHEAR = "Check bolt shear of plate"
IDS_ESBC_CHK_TENSION_REIS_WEB = "Check tension resistance of beam web"
IDS_ESBC_CHK_WEB_SUPPORTED = "Check web of supported member"
IDS_ESBC_CHK_SUPPORTING_COL = "Check supporting column"
IDS_ESBC_CHK_LONG_FIN_PLATE = "Long fin plate"
IDS_ESBC_CHK_SHORT_FIN_PLATE = "Short fin plate"
IDS_ESBC_CHK_SHEAR_RATIO = "Shear Ratio"
IDS_ESBC_CHK_PUNCHING_RATIO = "Punching Ratio"
IDS_ESBC_ORDINARY = "Ordinary"
IDS_ESBC_COUNTERSUNK = "Countersunk"
IDS_ESBC_SPACE_X = "Space(x)"
IDS_ESBC_SPACE_Y = "Space(y)"
IDS_ESBC_EXTENSION_X = "Extension(x)"
IDS_ESBC_EXTENSION_Y = "Extension(y)"
IDS_ESBC_CHK_EXTENSION = "Check Extension"
IDS_UCFT_GENERATE_REPORT = "Generating SRC CFT Column Report..."
IDS_UCFT_MATERIAL_STRENGTH_LIMITATION = "Material strength limitation"
IDS_UCFT_STEEL_SECTION_AREA_RATIO = "Steel section area ratio"
IDS_UCFT_CALC_FORCE_ALLOCATION = "Calculate force allocation"
IDS_UCFT_REQUIRED_SHEAR_FORCE_TRANSFERRED_SHEAR_CONNECTOR = "Required shear force transferred by shear connectors"
IDS_UCFT_CALC_DIRECT_BOND_STRENGTH = "Calculate direct bond strength"
IDS_UCFT_FILLED_COMPOSITE_COLUMN_EXTEND_TO_ONE_SIDE = "the filled composite column extends to one side"
IDS_UCFT_FILLED_COMPOSITE_COLUMN_EXTEND_TO_BOTH_SIDE = "the filled composite column extends to both side"
IDS_UCFT_CHECK_SECTION_CLASSIFICATION = "Check Section Classification"
IDS_UCFT_CHECK_CLASSIFICATION = "Classification"
IDS_UCFT_AXIAL = "Axial"
IDS_UCFT_FLEXURE = "Flexure"
IDS_UCFT_FOR_AXIAL = "for axial"
IDS_UCFT_FOR_FLEXURE = "for flexure"
IDS_UCFT_TREATED_COMPACT = "Therefore, the entire section is treated as compact."
IDS_UCFT_TREATED_NONCOMPACT = "Therefore, the entire section is treated as noncompact."
IDS_UCFT_OVER_LAMDA_MAX = "Therefore, the entire section width-thickness ratio is over "
IDS_UCFT_OVER = "Over"
IDS_UCFT_UNDER = "Under"
IDS_UCFT_SEISMIC = "Seismic"
IDS_UCFT_SPECIAL_PROVISION = "Special Provision"
IDS_UCFT_HIGH_DUCTILITY = "High Ductility"
IDS_UCFT_MIDDLE_DUCTILITY = "Middle Ductility"
IDS_UCFT_PLASTIC_MOMENT_ABOUT_MAJOR_AXIS = "Check Plastic Moment Strength About Major Axis"
IDS_UCFT_PLASTIC_MOMENT_ABOUT_MINOR_AXIS = "Check Plastic Moment Strength About Minor Axis"
IDS_UCFT_YIELD_MOMENT_ABOUT_MAJOR_AXIS = "Check Yield Moment Strength About Major Axis"
IDS_UCFT_YIELD_MOMENT_ABOUT_MINOR_AXIS = "Check Yield Moment Strength About Minor Axis"
IDS_UCFT_FIRSR_YIELD_MOMENT_ABOUT_MAJOR_AXIS = "Check First Yield Moment Strength About Major Axis"
IDS_UCFT_FIRSR_YIELD_MOMENT_ABOUT_MINOR_AXIS = "Check First Yield Moment Strength About Minor Axis"
IDS_UCFT_BY_AUROMESH = "AutoMesh"
IDS_UCCO_STEEL_HSS = "Steel HSS"
IDS_UCCO_CHECK_LOAD_TRANSFER = "Check Load Transfer"
IDS_UCCO_MATERIAL_N_SECTION = "Material & Section"
IDS_UCCO_CONCRETE_MATERIAL = "Concrete Material"
IDS_UCCO_STEEL_MATERIAL = "Steel Material"
IDS_UCCO_STEEL_SHAPE = "Steel Shape"
IDS_UCCO_EXTERNAL_FORCE_TO = "External force to"
IDS_UCCO_CFT_MEMBER_EXTEND_TO = "CFT member extends to"
IDS_UCCO_LOAD_TRANSFER = "Load Transfer"
IDS_UCCO_CHECK_LIMITATION = "Check Limitation"
IDS_UCCO_CHECK_MOMENT_STRENGTH = "Check Moment Strength"
IDS_UCCO_GENERATE_REPORT = "Generating SRC Column Report..."
IDS_UCCO_USE_CRITERIA_VALUE = "Use Criteria Value"
IDS_UCCO_AUTO_CALCULATE = "Auto Calculate."
IDS_UCCO_FLG = "Flg"
IDS_UCCO_CHECK_TRANSVERSE_REBAR_AREA = "Check transverse rebar area."
IDS_UCCO_USE_DETAIL_HOOP_BAR_END = "Use detail of Hoop Bar"
IDS_UCCO_INPUT_LIST = "SRC COLUMN INPUT LIST"
IDS_UCCO_LIMIT = "Limit"
IDS_UCCO_CHECK_REQUIREMENT_FOR_MATERIAL = "Check Requirement for Material"
IDS_UCCO_CALC_STEEL_RATIO = "Calculate steel ratio"
IDS_UCCO_CALC_MAIN_BAR_SPACE = "Calculate main bar space"
IDS_UCCO_CALC_CAPACITY_STEEL = "Calculate cacpcity of steel"
IDS_USBP_CHECK_DEVELOPEMENT_LENGTH_ANCHOR_BOLT = "Check Development Length of Anchor Bolt"
IDS_USBP_BASE_PLATE = "Base Plate"
IDS_USBP_ANCHOR_BOLT = "Anchor Bolt"
IDS_USBP_WING_PLATE = "Wing Plate"
IDS_USBP_RIB_PLATE = "Rib Plate"
IDS_USBP_RIB_WING_PLATE = "Rib Plate & Wing Plate"
IDS_USBP_PEDESTAL = "Pedestal"
IDS_USBP_CHECK_BEARING_STRESS_BASE_PLATE = "Check bearing stress of base plate"
IDS_USBP_REACTION_FORCE_NOT_EXIST = "Reaction Force not Exist."
IDS_USBP_BEARING_STRESS = "Bearing Stress"
IDS_USBP_BEARING_STRENGTH = "Bearing Strength"
IDS_USBP_CALC_BEARING_STRESS_CONCRETE = "Calculate Bearing Stress of Concrete"
IDS_USBP_CALC_BEARING_STRENGTH_CONCRETE = "Calculate Bearing Strength of Concrete"
IDS_USBP_CHECK_TENSILE_STRENGTH = "Check Tensile Strength"
IDS_USBP_TENSION_FORCE_IS_NOT_EXIST = "Tension Force is not Exist."
IDS_USBP_CHECK_DEVELOPMENT_LENGTH = "Check Development Length"
IDS_USBP_APPLIED_LCOM_BEARING_STRESS = "Applied Load Combination For Bearing Stress"
IDS_USBP_CHECK_TENSION_STRESS_ANCHOR_BOLT = "Check tensile stress of anchor bolt"
IDS_USBP_CHECK_TENSION_STRESS_BEARING = "Check tensile stress in Bearing"
IDS_USBP_TENSION_FORCE_NOT_EXIST = "Tension Force not Exist."
IDS_USBP_CHECK_BASE_PLATE = "Check base plate"
IDS_USBP_DESIGN_MOMENT_USE_AVERAGE = "Design Moment"
IDS_USBP_FORCE_DIAGRAM = "Force Diagram"
IDS_USBP_CHECK_RIB_PLATE = "Check rib plate"
IDS_USBP_CHECK_WING_PLATE = "Check wing plate"
IDS_USBP_CHECK_ANCHOR_BOLT_CIP = "Check anchor bolt"
IDS_USBP_ANCHOR_BOLT_NOT_EXIST = "Anchor Bolt Not EXIST."
IDS_USBP_CHECK_DEVELOP_LENGTH_ANCHOR_BOLT = "Check Development Length of Anchor Bolt"
IDS_USBP_INPUT_LIST = "STEEL BASE PLATE INPUT LIST"
IDS_USBP_START_ANGLE = "Start Angle"
IDS_USBP_GENERATE_REPORT = "Generating Steel Base Plate Report..."
IDS_USBP_CALC_BP_THK = "Calculate Base Plate Thickness"
IDS_CALC_THK_RATIO = "Calculate Base Plate Thickness Ratio"
IDS_EC_UNLIMITED = "Unlimited"
IDS_ESMC_GENERATE_REPORT = "Generating Moment Bolt Connection Report..."
IDS_ESBC_GENERATE_REPORT = "Generating Bolt Connection Report..."
IDS_ESMC_ALONE = "alone"
IDS_ESMC_AND = "and"
IDS_ESMC_OR = "or"
IDS_ESMC_APPLIED = "Applied"
IDS_ESMC_AREA = "Area"
IDS_ESMC_BEAM = "Beam"
IDS_ESMC_BEAMFLANGEANDWEB = "Beam Flange and Web"
IDS_ESMC_BEAMFLANGEWEBCOMPRESISTANCE = "Beam Flange and Web, Compression Resistance"
IDS_ESMC_BEAMFLANGEWEBINCOMPRESSION = "Beam Flange and Web in Compression Resistance"
IDS_ESMC_BEAMWEB = "Beam Web"
IDS_ESMC_BEAMWEBINTRANSVERSETENSION = "Beam Web in Transverse Tension"
IDS_ESMC_BOLT = "Bolt"
IDS_ESMC_BOLTBEARINGRESISTANCEATCOLUMNFLANGE = "Bolt Bearing Resistance at Column Flange"
IDS_ESMC_BOLTBEARINGRESISTANCEATENDPLATE = "Bolt Bearing Resistance at End Plate"
IDS_ESMC_BOLTGROUP = "Bolt Group"
IDS_ESMC_BOLTINFORMATION = "Bolt Information"
IDS_ESMC_BOLTINSHEAR = "Bolt in Shear"
IDS_ESMC_BOLTROW = "Bolt Row"
IDS_ESMC_BOLTSPACING = "Bolt Spacings"
IDS_ESMC_BOLTSPACING_COLUMN = "Edge Distance at Column"
IDS_ESMC_BOLTSPACING_PLATE = "Edge Distance at Plate"
IDS_ESMC_BOTTOMSTIFFENER = "Bottom Stiffener"
IDS_ESMC_BRACKET = "Bracket"
IDS_ESMC_BUCKLINGCURVE = "Buckling Curve"
IDS_ESMC_BUCKLINGRESISTANCE = "Buckling Resistance"
IDS_ESMC_CALCULATEAXIALFORCEEQILIBRIUM = "Axial Force Equilibrium"
IDS_ESMC_CALCULATEDEPTH = "Calculate Depth"
IDS_ESMC_CALCULATEEFFECTIVELENGTH = "Calculate Effective Length"
IDS_ESMC_COLUMN = "Column"
IDS_ESMC_COLUMNFLANGE = "Column Flange"
IDS_ESMC_COLUMNFLANGEINBENDING = "Column Flange in Bending"
IDS_ESMC_COLUMNWEB = "Column Web"
IDS_ESMC_COLUMNWEBBUCKLINGRESISTANCE = "Column Web, Buckling Resistance"
IDS_ESMC_COLUMNWEBBUCKLINGRESISTANCEWITHCOMPRESSIONSTIFFENER = "Column Web, Buckling Resistance with Compression Stiffener"
IDS_ESMC_COLUMNWEBCRUSHINGRESISTANCE = "Column Web, Crushing Resistance"
IDS_ESMC_COLUMNWEBCRUSHINGRESISTANCEWITHCOMPRESSIONSTIFFENER = "Column Web, Crushing Resistance with Compression Stiffener"
IDS_ESMC_COLUMNWEBINTRANSVERSECOMPRESSION = "Column Web in Transverse Compression"
IDS_ESMC_COLUMNWEBINTRANSVERSETENSION = "Column Web in Transverse Tension"
IDS_ESMC_COLUMNWEBPANELINSHEAR = "Column Web in Shear"
IDS_ESMC_COLUMNWEBPANELZONE = "Column Web Panel Zone"
IDS_ESMC_COLUMNWEBSTIFFENER = "Column Web Stiffener"
IDS_ESMC_COMBINED = "Combined"
IDS_ESMC_COMPRESSIONGOVERNED = "Compression Governed"
IDS_ESMC_COMPRESSIONRESISTANCEOFCOLUMNWEBSHEAR = "Column Web, Transverse Shear Resistance"
IDS_ESMC_COMPRESSIONSTIFFENERDIMENSIONS = "Compression Stiffener Dimensions"
IDS_ESMC_COMPRESSIONZONE = "Compression Zone"
IDS_ESMC_COMPRESSIVERESISTANCE = "Compressive Resistance"
IDS_ESMC_CONNECTION = "Connection"
IDS_ESMC_DEPTH = "Depth"
IDS_ESMC_DEPTHABOVE600MM = "Depth > 600mm"
IDS_ESMC_DEPTHBELOW600MM = "Depth < 600mm"
IDS_ESMC_DESIGNFORCE = "Design Force"
IDS_ESMC_DIA = "Dia."
IDS_ESMC_DOUBLE = "Double"
IDS_ESMC_EDGEDISTANCE = "Edge Distance"
IDS_ESMC_EFFECTIVEAREAOFSTIFFENERFORCRUSHING = "Effective Crushing Area with Compression Stiffener"
IDS_ESMC_EFFECTIVEAREAOFSTIFFENERWITHWEBPORTION = "Effective Buckling Area with Compression Stiffener"
IDS_ESMC_EFFECTIVESTIFFENERSECTIONFORBUCKLING = "Effective Stiffener Section Check for Buckling"
IDS_ESMC_EFFECTIVETENSIONRESISTANCEOFBOLTROWS = "Effective Tension Resistance of Bolt Rows"
IDS_ESMC_EFFECTIVEWIDTHOFWEBINCOMPRESSION = "Effective Width of Web in Compression"
IDS_ESMC_EFFETIVESHEARRESISTANCE = "Effective Shear Resistance"
IDS_ESMC_EFFRESISTANCE = "Eff. Resistance"
IDS_ESMC_EN1993-1-1 = "EN 1993-1-1"
IDS_ESMC_EN1993-1-8 = "EN 1993-1-8"
IDS_ESMC_EN2-2-2 = "2.2(2)"
IDS_ESMC_EN3-2-1_1 = "3.2.1(1)"
IDS_ESMC_EN6-1_1 = "6.1(1)"
IDS_ESMC_EN6-2-6-1 = "6.2.6.1"
IDS_ESMC_EN6-2-6-2 = "6.2.6.2"
IDS_ESMC_EN6-2-6-3 = "6.2.6.3"
IDS_ESMC_EN6-2-6-7 = "6.2.6.7"
IDS_ESMC_EN6-2-6-8 = "6.2.6.8"
IDS_ESMC_EN6-2-7-2 = "6.2.7.2"
IDS_ESMC_EN6-2-7-2_7 = "6.2.7.2(7)"
IDS_ESMC_ENDPLATE = "End Plate"
IDS_ESMC_ENDPLATEINBENDING = "End Plate in Bending"
IDS_ESMC_ENMODE1 = "Mode 1"
IDS_ESMC_ENMODE2 = "Mode 2"
IDS_ESMC_ENMODE3 = "Mode 3"
IDS_ESMC_ENP398 = "P398"
IDS_ESMC_ENSTEP5_WELDS = "STEP5 Welds"
IDS_ESMC_ENSTEP6A_TENSIONSTIFFENER = "STEP6A Tension Stiffener"
IDS_ESMC_ENTABLE3-1 = "Table 3.1"
IDS_ESMC_ENTABLE3-4 = "Table 3.4"
IDS_ESMC_ENTABLE6-2 = "Table 6.2"
IDS_ESMC_ENTABLE6-2ETC = "Table 6.2, 6.4, 6.5, 6.6"
IDS_ESMC_ENTABLE6-4ETC = "Table 6.4, 6.5, 6.6"
IDS_ESMC_EQULIBRIUMOFFORCES = "Equilibrium of Forces"
IDS_ESMC_GENERAL = "General"
IDS_ESMC_GIRDERFLANGERESISTANCE = "Girder Flange"
IDS_ESMC_HAUNCH = "Haunch"
IDS_ESMC_HAUNCHFLANGERESISTANCE = "Haunch Flange"
IDS_ESMC_HAUNCHWEBRESISTANCE = "Haunch Web"
IDS_ESMC_HOLEDIA = "Hole Dia."
IDS_ESMC_LAYOUT = "Bolt Group Layout"
IDS_ESMC_LENGTH = "Length"
IDS_ESMC_MODE1RESISTANCE = "Mode 1 Resistance"
IDS_ESMC_MODE2RESISTANCE = "Mode 2 Resistance"
IDS_ESMC_MODE3RESISTANCE = "Mode 3 Resistance"
IDS_ESMC_MOMENTFORCEMINUS = "Row 1 indicates a bottom row of the bolt group"
IDS_ESMC_MOMENTFORCEPLUS = "Row 1 indicates a top row of the bolt group"
IDS_ESMC_MOMENTRESISTANCE = "Moment Resistance"
IDS_ESMC_MOMENTRESISTANCEWITHHAUNCH = "Moment Resistance with Haunch"
IDS_ESMC_MOMENTRESISTANCEWITHOUTHAUNCH = "Moment Resistance without Haunch"
IDS_ESMC_NAME = "Name"
IDS_ESMC_NET = "Net"
IDS_ESMC_NOCOLUMNS = "No. Columns"
IDS_ESMC_NOREDUCTION = "No Reduction"
IDS_ESMC_NOROWS = "No. Rows"
IDS_ESMC_NOTAPPLIED = "Not Applied"
IDS_ESMC_NOTCHECK = "Not Check"
IDS_ESMC_OK = "OK"
IDS_ESMC_PARTIALFACTOR_CONNECTION = "Partial Factors of Connection"
IDS_ESMC_PARTIALFACTOR_STEEL = "Partial Factors of Structural Steel"
IDS_ESMC_PLATE = "Plate"
IDS_ESMC_PLATEBUCKLINGREDUCTIONFACTOR = "Plate Buckling Reduction Factor"
IDS_ESMC_PLATESLENDERNESS = "Plate Slenderness"
IDS_ESMC_PRETENSION = "Pretension"
IDS_ESMC_REDUCTION = "Reduction"
IDS_ESMC_REDUCTIONFACTORFORLONGITUDINALCOMPRESSIVESTRESS = "Reduction Factor for Longitudinal Compressive Stress"
IDS_ESMC_REDUCTIONFACTORFORSHEARINTERACTION = "Reduction Factor for Shear Interaction"
IDS_ESMC_RESISTANCE = "Resistance"
IDS_ESMC_RESISTANCEOFCOLUMNFLANGEINBENDING = "Resistance of Column Flange in Bending"
IDS_ESMC_RESISTANCEOFENDPLATEINBENDING = "Resistance of End Plate in Bending"
IDS_ESMC_RESISTANCEWITHHAUNCH = "Resistance with Haunch"
IDS_ESMC_ROW = "Row"
IDS_ESMC_SECTION = "Section"
IDS_ESMC_SHEARREISTANCEOFSTIFFENEDWEB = "Shear Resistance of Stiffened Web"
IDS_ESMC_SHEARREISTANCEOFUNSTIFFENEDWEB = "Shear Resistance of Unstiffened Web"
IDS_ESMC_SHEARRESISTANCE = "Shear Resistance"
IDS_ESMC_SPACING = "Spacing"
IDS_ESMC_STEEL = "Structural Steel"
IDS_ESMC_STIFFENEDCOLUMNWEB = "Column Web Resistance"
IDS_ESMC_STIFFENERSIZE = "Stiffener Size"
IDS_ESMC_SUMMARYBOLTROW = "Summary: Bolt Row"
IDS_ESMC_SUMMARYMOMENTRESISTANCE = "Summary: Moment Resistance"
IDS_ESMC_SUMMARYRESISTANCEOFCOMPRESSIONZONE = "Summary: Resistance of Compression Zone"
IDS_ESMC_TENSIONGOVERNED = "Tension Governed"
IDS_ESMC_TENSIONRESISTANCEOFBOLTROWS = "Tension Resistance of Bolt Rows"
IDS_ESMC_TENSIONSTIFFENERCHECK = "Tension Stiffener Check"
IDS_ESMC_TENSIONSTIFFENERDIMENSIONS = "Tension Stiffener Dimensions"
IDS_ESMC_TENSIONSTIFFENERNOREQUIRED = "Tension Stiffeners are not required for column web"
IDS_ESMC_TENSIONSTIFFENERREQUIRED = "Tension stiffeners are required for column web"
IDS_ESMC_TENSIONSTIFFENERRESISTANCE = "Tension Stiffener Resistance"
IDS_ESMC_TENSIONZONETSTUBS = "Tension Zone T-stubs"
IDS_ESMC_THICKNESS = "Thickness"
IDS_ESMC_TOPSTIFFENER = "Top Stiffener"
IDS_ESMC_VERTICALSHEARRESISTANCE = "Vertical Shear Resistance"
IDS_ESMC_WEBRESISTANCE = "Girder Web"
IDS_ESMC_WELDSCHECK = "Weld Check"
IDS_ESMC_WELDSIDES = "Weld Sides"
IDS_ESMC_WIDTH = "Width"
IDS_ESMC_WITHROW = "with Row"
IDS_EC_FLANGE = "Flange"
IDS_EC_WEB = "Web"
IDS_EC_MEMBER_TYPE = "Member Type"
IDS_EC_SECTION_PROPERTY = "Section Property"
IDS_EC_BUILT_UP = "Built up"
IDS_EC_ROLLED = "Rolled"
IDS_EC_CHK_ITEMS = "Check Items"
IDS_EC_MAJOR_AXIS_X = "Major Axis (X)"
IDS_EC_MINOR_AXIS_Y = "Minor Axis (Y)"
IDS_EC_REQUIRED = "Required"
IDS_EC_NO_REQUIRED = "No Required"
IDS_EC_CLASS = "Class"
IDS_EC_CLASS1 = "Class 1"
IDS_EC_CLASS2 = "Class 2"
IDS_EC_CLASS3 = "Class 3"
IDS_EC_CLASS4 = "Class 4"
IDS_EC_TABLE = "Table"
IDS_ESSG_KIJ_ANNEX = "Interaction factor Annex"
IDS_ESSG_DETERMINATIO_INTERACTION_FACTOR = "Determination of interaction factor"
IDS_ESSG_METHOD_1_ANNEX_A = "Use method 1 given in Annex A"
IDS_ESSG_METHOD_2_ANNEX_B = "Use method 2 given in Annex B"
IDS_ESSG_CHK_AXIAL_RESISTANCE = "Check axial resistance"
IDS_ESSG_CALC_COMP_AXIAL_RESISTANCE = "Calculate compression axial resistance"
IDS_ESSG_CALC_TENS_AXIAL_RESISTANCE = "Calculate tension axial resistance"
IDS_ESSG_CHK_SHEAR_RESISTANCE = "Check shear resistance"
IDS_ESSG_CALC_SHEAR_RESISTANCE_MAJOR = "Calculate shear resistance about major axis (y)"
IDS_ESSG_CALC_SHEAR_RESISTANCE_MINOR = "Calculate shear resistance about minor axis (x)"
IDS_ESSG_APPLY_RIGID_END_POST = "Apply rigid end post Type"
IDS_ESSG_APPLY_NON_RIGID_END_POST = "Apply Non-rigid end post Type"
IDS_ESSG_CHK_MOMENT_RESISTANCE = "Check moment resistance"
IDS_ESSG_CALC_MOMENT_RESISTANCE_MAJOR = "Calculate moment resistance about major axis (x)"
IDS_ESSG_CALC_MOMENT_RESISTANCE_MINOR = "Calculate moment resistance about minor axis (y)"
IDS_ESSG_CHK_BENDING_SHEAR_RESISTANCE = "Check bending and shear resistance"
IDS_ESSG_BENDING_SHEAR_RESISTANCE = "Bending and shear resistance"
IDS_ESSG_CALC_BENDING_SHEAR_RESISTANCE_MAJOR = "Calculate bending and shear resistance about major axis"
IDS_ESSG_CALC_BENDING_SHEAR_RESISTANCE_MINOR = "Calculate bending and shear resistance about minor axis"
IDS_ESSG_CHK_BENDING_AXIAL_RESISTANCE = "Check bending and axial resistance"
IDS_ESSG_BENDING_AXIAL_RESISTANCE = "Bending and axial resistance"
IDS_ESSG_CALC_BENDING_AXIAL_RESISTANCE = "Calculate bending and axial resistance"
IDS_ESSG_CHK_GENERAL_INTERACTION_RATIO = "Check general interaction ratio"
IDS_ESSG_CHK_BENDING_SHEAR_AXIAL_RESISTANCE = "Check bending, shear and axial resistance"
IDS_ESSG_BENDING_SHEAR_AXIAL_RESISTANCE = "Bending, shear and axial resistance"
IDS_ESSG_CALC_BENDING_SHEAR_AXIAL_RESISTANCE_MAJOR = "Calculate bending and shear and axial resistance about major axis"
IDS_ESSG_CALC_BENDING_SHEAR_AXIAL_RESISTANCE_MINOR = "Calculate bending and shear and axial resistance about minor axis"
IDS_ESSG_CHK_FBR_RESISTANCE = "Check flexural buckling resistance"
IDS_ESSG_FBR_RESISTANCE = "Flexural buckling resistance"
IDS_ESSG_CALC_FBR_RESISTANCE_MAJOR = "Calculate flexural buckling resistance about major axis"
IDS_ESSG_CALC_FBR_RESISTANCE_MINOR = "Calculate flexural buckling resistance about minor axis"
IDS_ESSG_CHK_TB_TFB_RESISTANCE = "Check torsional and torsional-flexural buckling"
IDS_ESSG_TB_TFB_RESISTANCE = "Torsional and torsional-flexural buckling"
IDS_ESSG_CALC_TB_RESISTANCE = "Calculate torsional buckling resistance"
IDS_ESSG_CALC_TFB_RESISTANCE = "Calculate torsional-flexural buckling resistance"
IDS_ESSG_CHK_LTB_RESISTANCE = "Check lateral torsional buckling resistance"
IDS_ESSG_LTB_RESISTANCE = "Lateral torsional buckling resistance"
IDS_ESSG_CALC_LTB_RESISTANCE = "Calculate lateral torsional buckling resistance"
IDS_ESSG_CHK_BNC_RESISTANCE = "Check uniform member in bending and axial compression"
IDS_ESSG_BNC_RESISTANCE = "Uniform member in Bending and axial compression"
IDS_ESSG_CALC_BNC_RESISTANCE = "Calculate uniform member in bending and axial compression resistance"
IDS_ESSG_CHK_SHEAR_BUCKLING_RESISTANCE = "Check shear buckling resistance"
IDS_ESSG_SHEAR_BUCKLING_RESISTANCE = "Shear buckling resistance"
IDS_ESSG_CALC_SHEAR_BUCKLING_MAJOR = "Calculate shear buckling resistance about major axis"
IDS_ESSG_CALC_SHEAR_BUCKLING_MINOR = "Calculate shear buckling resistance about minor axis"
IDS_ESSG_HIGH_SHAER = "High shear"
IDS_ESSG_NOT_HIGH_SHAER = "Not high shear"
IDS_ESSG_NEGLECT_EFFECT_ON_MOMNET_RESISTANCE = "Neglect its effect on the moment resistance."
IDS_ESSG_NO_REQUIRED_REDUCE_FOLLOWING_CONDITION = "No required to reduce under following condition."
IDS_ESSG_NO_REQUIRED_REDUCE_B_FOLLOWING_CONDITION = "No required to reduce bending resistance under following condition."
IDS_ESSG_NO_REQUIRED_REDUCE_B_A_FOLLOWING_CONDITION = "No required to reduce bending axial resistance under following condition."
IDS_ESSG_NO_REQUIRED_REDUCE_B_A_FOLLOWING_CONDITION_MINOR_AXIS = "No required to reduce bending axial resistance condition for minor axis under following."
IDS_ESSG_NO_REQUIRED_REDUCE_B_A_FOLLOWING_CONDITION_MAJOR_AXIS = "No required to reduce bending axial resistance condition for major axis under following."
IDS_ESSG_ALLOWANCE_FOR_EFFECT_ON_MAJOR_AND_MINOR_AXIS = "Allowance for the effect of axial force on the major and minor axis under following. "
IDS_ESSG_BUCKLING_CURVE = "Buckling Curve"
IDS_ESSG_LATERAL_TORSIONAL_BUCKLING_CURVE = "Lateral torsional Buckling Curve"
IDS_ESSG_LATERAL_TORSIONAL_N_BUCKLING_CURVE = "Lateral torsional\nBuckling Curve"
IDS_ESSG_NO_REQUIRED_TO_CHK_FBR = "No required to check buckling resistance"
IDS_ESSG_NO_REQUIRED_TO_CHK_TFB = "No required to check torsional and torsional-flexural buckling"
IDS_ESSG_NO_REQUIRED_TO_CHK_LTB = "No required to check lateral torsional buckling"
IDS_ESSG_NO_REQUIRED_TO_CHK_BNC = "No required to check bending and axial compression resistance"
IDS_ESSG_NO_REQUIRED_TO_CHK_SHEARBUCK = "No required to check shear buckling"
IDS_ESSG_BUCKLING_EFFECT_MAY_BE_IGNORED = "Buckling effects may be ignored."
IDS_ESSG_BUCKLING_EFFECT_SHOULD_BE_CONSIDERD = "Buckling effects should be considered."
IDS_ESSG_NO_CALCULATED_BY_ANNEX_A = "Calculated by Annex A"
IDS_ESSG_NO_CALCULATED_BY_ANNEX_B = "Calculated by Annex B"
IDS_ADDITIONAL_BEARING_WIDTH_EN1993_1_8_CL626 = "Additional Bearing Width (EN1993-1-8 cl6.2.6)"
IDS_ANCHOR_BOLT_BEARING_RESISTANCE = "Anchor Bolt Bearing Resistance"
IDS_ANCHOR_BOLT_FRICTION_RESISTANCE = "Anchor Bolt Friction Resistance"
IDS_ANCHOR_BOLT_SHEAR_PROPERTIES = "Anchor Bolt Shear Properties"
IDS_ANCHOR_BOLT_TENSILE_RESISTANCE = "Anchor Bolt Tensile Resistance"
IDS_ASSEMBLYSTRONG_AXIS = "Assembly(Strong Axis)"
IDS_ASSEMBLYWEAK_AXIS = "Assembly(Weak Axis)"
IDS_BASE_PLATE_AND_ANCHOR_BOLT_PROPERTIES = "Base plate and Anchor Bolt Properties"
IDS_BASE_PLATE_IN_BENDING_AND_ANCHOR_BOL_IN_TENS_S = "Base Plate in Bending and Anchor Bolts in Tension(Strong Axis)"
IDS_BASE_PLATE_IN_BENDING_AND_ANCHOR_BOL_IN_TENS_W = "Base Plate in Bending and Anchor Bolts in Tension(Weak Axis)"
IDS_BASE_PLATE_IN_BENDING_AND_CONCRETE_IN_COMPRE_S = "Base Plate in Bending and Concrete in compression(Strong Axis)"
IDS_BASE_PLATE_IN_BENDING_AND_CONCRETE_IN_COMPRE_W = "Base Plate in Bending and Concrete in compression(Weak Axis)"
IDS_BASE_PLATE_RESISTANCE_IN_COMPRESSION = "Base Plate Resistance in compression"
IDS_BASE_PLATE_RESISTANCE_IN_TENSION = "Base Plate Resistance in Tension"
IDS_BEARING_STRENGTHEN1993_1_8_CL625_ = "Bearing Strength(EN1993-1-8 cl6.2.5) "
IDS_BTR = "BTR"
IDS_CALCULATION_OF_EFFECTIVE_LENGTH = "Calculation of Effective Length"
IDS_CALCULATION_OF_EFFECTIVE_LENGTH_EN1993_1_8_626 = "Calculation of Effective Length (EN1993-1-8 6.2.6.4)"
IDS_CALCULATION_OF_EFFECTIVE_LENGTH_INNER_BOLTS = "Calculation of Effective Length (Inner Bolts)"
IDS_CALCULATION_OF_EFFECTIVE_LENGTH_OUTER_BOLTS = "Calculation of Effective Length (Outer Bolts)"
IDS_CALCULATION_OF_JOINT_RESISTANCE = "Calculation of joint Resistance"
IDS_CHECK_BOLT_SHEAR = "Check Bolt Shear"
IDS_CHECK_BOLT_TENSION = "Check Bolt Tension"
IDS_CHECK_COMBINED_SHEAR_AND_TORSION = "Check Combined Shear and Torsion"
IDS_CHECK_FOR_NO_OVERLAP_CONDITION = "Check For No Overlap Condition"
IDS_CHECK_FOR_PRYING_CONDITION = "Check for Prying Condition"
IDS_CHECK_IF_EFFECTIVE_AREA_FITS_ON_THE_BASE_PLATE = "Check if effective area fits on the Base Plate"
IDS_COMLUMNFLANGE_AND_WEB_IN_COMPRESSIONSTRONG_AXI = "Comlumn,Flange and Web in compression(Strong Axis)"
IDS_COMPRESSED_PART_RESISTANCE = "Compressed Part Resistance"
IDS_COMPRESSIVE_CAPACITY_CALCULATIONSTRONG_AXIS = "Compressive Capacity calculation(Strong Axis)"
IDS_COMPRESSIVE_RESISTANCE_CALCULATION = "Compressive Resistance Calculation"
IDS_COMPRESSIVE_RESISTANCE_CHECK = "Compressive Resistance Check"
IDS_CORRELATION_FACTOR_FOR_FILLET_WELD = "Correlation Factor for fillet weld"
IDS_DESIGN_ANCHOR_BOLT_RESISTANCE = "Design Anchor Bolt Resistance"
IDS_DESIGN_BOND_ANCHORAGE_RESISTANCE = "Design Bond Anchorage Resistance"
IDS_DESIGN_CASE__LEFT_SIDE_IN_COMPRESSION_RIGHT_S = "Design Case : Left Side in Compression, Right Side in Compression"
IDS_DESIGN_CASE__LEFT_SIDE_IN_TENSION_RIGHT_SIDE_ = "Design Case : Left Side in Tension, Right Side in Tension"
IDS_DESIGN_COMPRESSION_RESISTANCE_OF_FLANGE = "Design Compression Resistance of Flange"
IDS_DESIGN_MOMENT_RESISTANCE_OF_COLUMN_BASE = "Design Moment Resistance of Column Base"
IDS_DESIGN_SHEAR_RESISTANCE_FOR_FILLET_WELD_IN_X_D = "Design Shear Resistance for fillet weld in X direction"
IDS_DESIGN_SHEAR_RESISTANCE_FOR_FILLET_WELD_IN_Y_D = "Design Shear Resistance for fillet weld in Y direction"
IDS_DESIGN_TENSILE_RESISTANCE_FOR_FILLET_WELD = "Design Tensile Resistance for fillet weld"
IDS_EFFECTIVE_AREA_CALCULATION = "Effective Area Calculation"
IDS_EFFECTIVE_AREA_FROM_FORCE_EQUILIBRIUM_EN1993_1 = "Effective Area from force equilibrium (EN1993-1-8 Cl.6.2.5)"
IDS_EFFECTIVE_AREA_OF_COMPRESSED_T_STUB = "Effective Area of compressed T-Stub"
IDS_EFFECTIVE_LENGTHWIDTH_AND_AREA = "Effective Length,Width and Area"
IDS_EQUIVALENT_FORCE_CALCULATION_COLUMN_FLANGE = "Equivalent Force Calculation (Column Flange)"
IDS_EQUIVALENT_FORCE_CALCULATION_T_STUB = "Equivalent Force Calculation (T-Stub)"
IDS_FACTOR_M_FOR_OUTER_BOLTS = "Factor m for Outer Bolts"
IDS_GROUT_INFLUENCING_CONCRETE_BEARING_RESISTANCE = "Grout Influencing Concrete Bearing Resistance"
IDS_GROUT_NOT_INFLUENCING_CONCRETE_BEARING_RESISTA = "Grout NOT Influencing Concrete Bearing Resistance"
IDS_LEAVER_ARM_OF_COMPRESSION_PART = "Leaver Arm of Compression Part"
IDS_LEAVER_ARM_OF_TENSION_PART = "Leaver Arm of Tension Part"
IDS_LOAD_ECCENTRICITY = "Load Eccentricity"
IDS_MOMENT_CAPACITY = "Moment Capacity"
IDS_NO = "No"
IDS_NOX = "No(X)"
IDS_NOY = "No(Y)"
IDS_PLASTIC_BENDING_MOMENT_CAPACITY_OF_BASE_PLATE = "Plastic Bending Moment Capacity of Base Plate"
IDS_PLASTIC_BENDING_MOMENT_CAPACITY_OF_BASE_PLATE_ = "Plastic Bending Moment Capacity of Base Plate Per Unit Length"
IDS_PLASTIC_BENDING_MOMENT_CAPACITY_OF_THE_COLUMN = "Plastic Bending Moment Capacity of the column"
IDS_PRESENCE_OF_PRYING_EFFECT = "Presence of Prying Effect"
IDS_RATIOX = "Ratio(x)"
IDS_RATIOY = "Ratio(y)"
IDS_REDUCING_MOMENT_CAPACITY_EN1993_1_16282_ = "Reducing Moment Capacity (EN1993-1-1,6.2.8(2) "
IDS_REDUCING_MOMENT_CAPACITY_EN1993_1_162914__629 = "Reducing Moment Capacity (EN1993-1-1,6.2.9.1(4) & 6.2.9.1(5)"
IDS_RESISTANCE_OF_FAILURE_MODE_1 = "Resistance of failure mode 1"
IDS_RESISTANCE_OF_FAILURE_MODE_1_2 = "Resistance of Failure Mode 1-2"
IDS_RESISTANCE_OF_FAILURE_MODE_2 = "Resistance of failure mode 2"
IDS_RESISTANCE_OF_FAILURE_MODE_3 = "Resistance of failure mode 3"
IDS_RESISTANCE_OF_FAILURE_MODE_4COLUMN_WEB_IN_TENS = "Resistance of failure mode 4(Column Web in Tension) "
IDS_RESISTANCE_OF_T_STUB_FAILURE_MODE_1_2EN1993_1_ = "Resistance of T Stub Failure Mode 1-2(EN1993-1-8 Cl.6.2.4.1)"
IDS_RESISTANCE_OF_T_STUB_IN_TENSION = "Resistance of T Stub in Tension"
IDS_RESISTANCE_OF_TENSION_T_STUB = "Resistance of Tension T-Stub"
IDS_RIB = "rib"
IDS_SHEAR_DESIGNEN1993_1_8_TABLE_34 = "Shear Design(EN1993-1-8 Table 3.4)"
IDS_SHEAR_FORCE_NOT_EXIST = "Shear Force not Exist."
IDS_T = "t"
IDS_TENSION_FORCES = "Tension Forces"
IDS_TENSION_PART_RESISTANCE_VERIFICATION = "Tension Part Resistance Verification"
IDS_TENSION_RESISTANCE_FACTORS = "Tension Resistance Factors"
IDS_TENSION_RESISTANCE_OF_BOLTS = "Tension Resistance of Bolts"
IDS_WELDING_CHECK_EN_1993_1_8_CL4533 = "Welding Check (EN 1993-1-8 Cl.4.5.3.3)"
IDS_WELDING_RATIO = "Welding Ratio"
IDS_WIDTH_OF_STRIP_AROUND_COLUMN_C_S_EN1993_1_8_CL = "Width of Strip around column C/S (EN1993-1-8 cl6.2.6)"
IDS_WING = "wing"
IDS_CHECK_EDGE_DISTANCE_POST_INSTALLED_ANCHOR_BOLT = "Check Edge Distance (Post Installed Anchor Bolt)"
IDS_CALCULATE_TENSILE_STRENGTH_POST_INSTALLED_ANCHOR_BOLT = "Calculate Tensile Strength (Post Installed Anchor Bolt)"
IDS_CALCULATE_SHEAR_STRENGTH_POST_INSTALLED_ANCHOR_BOLT = "Calculate Shear Strength (Post Installed Anchor Bolt)"
IDS_CHECK_DISTANCE_FROM_CONCRETE_EDGE_TO_CENTER_OF_ANCHOR_BOLT = "Check Distance from Concrete Edge to Center of Anchor Bolt"
IDS_CALCULATE_STRENGTH_OF_STEEL = "Calculate Strength of Steel"
IDS_CALCULATE_SIZE_DATA = "Calculate Size Data"
IDS_CALCULATE_CONCRETE_BREAK_OUT_STRENGTH = "Calculate Concrete Break-Out Strength"
IDS_CALCULATE_PULL_OUT_STRENGTH_OF_ANCHOR = "Calculate Pull-Out Strength of Anchor"
IDS_CONCRETE_BREAK_OUT_STRENGTH_DIRECTION_X = "Concrete Break-Out Strength, Direction X"
IDS_CONCRETE_BREAK_OUT_STRENGTH_DIRECTION_Y = "Concrete Break-Out Strength, Direction Y"
IDS_CALCULATE_CONCRETE_PRY_OUT_STRENGTH = "Calculate Concrete Pry-Out Strength"
IDS_CALCULATE_COMBINED_RATIO = "Calculate Combined Ratio"
IDS_CONDITION = "Condition"
IDS_EQUATION = "Equation"
IDS_RC_ANCHOR_BOLT_INPUT_LIST = "RC ANCHOR BOLT INPUT LIST"
IDS_CHECK_FLANGE_AND_WEB_UNDER_CONCENTRATED_FORCE = "Check Flange and Web under Concentrated Force"
IDS_CHECK_IF_STIFFENER_IS_REQUIRED = "Check if stiffener is required"
IDS_CHECK_REQUIREMENT_FOR_STIFFENER = "Check Requirement for Stiffener"
IDS_CHECK_REQUIREMENT_FOR_TENSION_FIELD_ACTION = "Check Requirement for Tension Field Action"
IDS_CHECK_REQUIREMENT_FOR_STIFFENER_TO_APPLY_TENSION_FIELD_ACTION = "Check Requirement for Stiffener to apply Tension Field Action"
IDS_CHECK_WEB_UNDER_CONCENTRATED_FORCE = "Check Web Under Concentrated Force"
IDS_COLUMNS = "Columns"
IDS_UNIFORM_LOAD = "Uniform Load"
IDS_FINISH_LOAD = "Finish Load"
IDS_CONSTRUCTION_LOAD = "Construction Load"
IDS_CONSTRUCTION_STAGE = "Construction Stage"
IDS_CHECK_REQUIREMENT_FOR_STUD = "Check Requirement for Stud"
IDS_CHECK_SIZE = "Check Size"
IDS_CHECK_MATERIAL = "Check Material"
IDS_MATERIAL_PROPERTIES_APPLIED = "Material Properties (Applied)"
IDS_CALCULATE_EFFECTIVE_WIDTH_OF_SLAB = "Calculate Effective Width of Slab"
IDS_EFFECTIVE_WIDTH_OF_SLAB = "Effective Width of Slab"
IDS_THICKNESS_OF_CONCRETE = "Thickness of Concrete"
IDS_CALCULATE_DESIGN_SHEAR_FORCE = "Calculate Design Shear Force"
IDS_CALCULATE_DESIGN_FORCE_DURING_CONSTRUCTION = "Calculate Design Force during Construction"
IDS_CHECK_DEFLECTION_DURING_CONSTRUCTION = "Check Deflection during Construction"
IDS_CHECK_DEFLECTION_BY_DEAD_LOAD = "Check Deflection by Dead Load"
IDS_CHECK_DEFLECTION_BY_LIVE_LOAD = "Check Deflection by Live Load"
IDS_CALCULATE_STRENGTH_OF_STUD = "Calculate Strength of Stud"
IDS_CALCULATE_ELASTIC_MODULUS_OF_CONCRETE = "Calculate Elastic Modulus of Concrete"
IDS_CALCULATE_NUMBER_OF_STUD = "Calculate Number of Stud"
IDS_CALCULATE_COMPOSITION_RATIO = "Calculate Composition Ratio"
IDS_CHECK_MOMENT_STRENGTH_POSITIVE_MOMENT = "Check Moment Strength (Positive Moment)"
IDS_CALCULATE_MOMENT_OF_INERTIA = "Calculate Moment of Inertia"
IDS_CALCULATE_EFFECTIVE_MOMENT_OF_INERTIA = "Calculate Effective Moment of Inertia"
IDS_CALCULATE_LOWER_LIMIT_FOR_MOMENT_OF_INERTIA = "Calculate Lower Limit for Moment of Inertia"
IDS_CALCULATE_BEAM_MODE_PROPERTIES = "Calculate Beam Mode Properties"
IDS_CALCULATE_EFFECTIVE_WIDTH = "Calculate Effective Width"
IDS_CALCULATE_TRANSFORMED_MOMENT_OF_INERTIA = "Calculate Transformed Moment of Inertia"
IDS_CALCULATE_DEFLECTION__FREQUENCY = "Calculate Deflection & Frequency"
IDS_CALCULATE_TRANSFORMED_MOMENT_OF_INERTIA_PER_UNIT_WIDTH = "Calculate Transformed Moment of Inertia per Unit Width"
IDS_CALCULATE_EFFECTIVE_BEAM_PANEL_WIDTH = "Calculate Effective Beam Panel Width"
IDS_CALCULATE_WEIGHT_OF_BEAM_PANEL = "Calculate Weight of Beam Panel"
IDS_CALCULATE_GIRDER_MODE_PROPERTIES = "Calculate Girder Mode Properties"
IDS_CALCULATE_EFFECTIVE_GIRDER_PANEL_WIDTH = "Calculate Effective Girder Panel Width"
IDS_CHECK_VIBRATION_COMBINED_MODE = "Check Vibration (Combined Mode)"
IDS_ADJUST_GIRDER_DEFLECTION = "Adjust Girder Deflection"
IDS_CALCULATE_FLOOR_FUNDAMENTAL_FREQUENCY = "Calculate Floor Fundamental Frequency"
IDS_CALCULATE_EQUIVALENT_COMBINED_MODE_PANEL_WEIGHT = "Calculate Equivalent Combined Mode Panel Weight"
IDS_CALCULATE_PEAK_ACCELERATION = "Calculate Peak Acceleration"
IDS_H_BEAM__SLAB = "H-Beam & Slab"
IDS_CONST_LOAD = "Const. Load"
IDS_CONCENTRATED_FORCES = "Concentrated Forces"
IDS_CONSTRUCTION = "Construction"
IDS_DEAD__LIVE = "Dead & Live"
IDS_PLASTIC_DESIGN_COMPACT_SECTION = "Plastic Design (Compact Section)"
IDS_ELASTIC_DESIGN_COMPACT_SECTION = "Elastic Design (Non-Compact Section)"
IDS_MAX = "Max."
IDS_V = "V'"
IDS_COMP_RATIO = "Comp. Ratio"
IDS_N = "n"
IDS_CALCULATE_EFFECTIVE_BEAM_PANEL_WIDTH__WEIGHT = "Calculate Effective Beam Panel Width & Weight"
IDS_CALCULATE_EFFECTIVE_GIRDER_PANEL_WIDTH__WEIGHT = "Calculate Effective Girder Panel Width & Weight"
IDS_W = "W"
IDS_FLOOR_FREQUENCY_HZ = "Floor Frequency (Hz)"
IDS_PEAK_ACCELERATION_%_GRAVITY = "Peak Acceleration (% Gravity)"
IDS_SRC_COMPOSITE_BEAM_INPUT_LIST = "SRC COMPOSITE BEAM INPUT LIST"
IDS_SECTION_H_BEAM__SLAB = "Section (H-Beam & Slab)"
IDS_SECTION_STUD = "Section (Stud)"
IDS_SECTION_DECK_PLATE = "Section (Deck Plate)"
IDS_DESIGN_LOAD_UNIFORM_LOAD = "Design Load (Uniform Load)"
IDS_DESIGN_FORCE_CONCENTRATED_FORCES = "Design Force (Concentrated Forces)"
IDS_NOWEB = "No.Web"
IDS_NOFLANGE = "No.Flange"
IDS_PM = "PM"
IDS_VX = "Vx"
IDS_VY = "Vy"
IDS_C = "C"
IDS_D = "D"
IDS_HOOP_BAR = "Hoop Bar"
IDS_CHECK_REQUIREMENT_FOR_MATERIAL = "Check Requirement for Material"
IDS_CALCULATE_STEEL_RATIO = "Calculate steel ratio"
IDS_CALCULATE_MAIN_BAR_SPACE = "Calculate main bar space"
IDS_CALCULATE_ECCENTRICITY = "Calculate eccentricity"
IDS_COLUMN_UNDER_TENSION_FORCE_SKIPPED = "Column under tension force. Skipped."
IDS_CALCULATE_CAPACITY_OF_STEEL = "Calculate capacity of Steel"
IDS_CALCULATE_NOMINAL_CAPACITY_FOR_NEUTRAL_AXIS = "Calculate nominal capacity for neutral axis"
IDS_F = "f"
IDS_CONC = "conc"
IDS_STEEL = "steel"
IDS_CONCRETE_SECTION = "Concrete Section"
IDS_H_BEAM__REBAR = "H-Beam & Rebar"
IDS_HOOP_BAREND = "Hoop Bar(END)"
IDS_STEEL_BEAM_AT_CONSTRUCTION_STAGE = "Steel beam at construction stage"
IDS_COMPOSITE_BEAM_AT_NORMAL_STAGE = "Composite beam at normal stage"
IDS_CHECK_NEUTRAL_AXIS_IN_SECTION = "Check neutral axis in section"
IDS_PLASTIC_NA = "Plastic N.A."
IDS_COORINATE_OF_PLASTIC_NA = "Coordinate of Plastic N.A."
IDS_CHECK_BENDING_RESISTANCE = "Check bending resistance"
IDS_NAXIS_CONDITION = "Condition"
IDS_NAXIS_EQUATION_FOR = "Equation for"
IDS_NAXIS_VALUE = "Value"
IDS_CALCULATION = "Calculation"
IDS_CALCULATION_FOR_K = "Calculation for k"
IDS_ELASTIC_MOMENT_RESISTANCE = "Calculation of elastic moment resistance"
IDS_PLASTIC_MOMENT_RESISTNACE = "Calculation of plastic moment resistance"
IDS_CALCULATION_OF = "Calculation of"
IDS_ELASTIC_NA = "Elastic N.A."
IDS_COORDINATE_OF_ELASTIC_NA = "Coordinate of Elastic N.A."
IDS_CHECK_EFFECTIVE_COMPOSTIE_SECTION = "Check effective composite section"
IDS_POSITION = "Position"
IDS_EQUATION_FOR_K = "Equation for k"
IDS_STEEL_TOP_FLANGE = "Steel Top Flange"
IDS_STEEL_WEB = "Steel Web"
IDS_STEEL_BOT_FLANGE = "Steel Bottom Flange"
IDS_CONCRETE_SLAB = "Concrete Slab"
IDS_REINFORCING_STEEL = "Reinforcing Steel"
IDS_SECTION_MODULUS_AT_AN_INTERNAL_SUPPORT = "Section modulus at an internal support"
IDS_TABLE_OF_SECTION_MODULUS_AT_EACH_PART_IN_SECTION = "Table of section modulus at each part in section"
IDS_STEEL_SECTION = "Steel Section"
IDS_COMPOSITE_SECTION = "Composite Section"
IDS_CALCULATION_FOR_MOMENT_CAPACITY_OF_SECTION = "Calculation for moment capacity of section"
IDS_PART = "Part"
IDS_AXIAL_COMP_CAPACITY = "Axial Comp. Capacity"
IDS_ARM_LENGTH = "Arm Length"
IDS_MOMENT_CAPACITY_TABLE = "Moment Capacity"
IDS_TOTAL = "Total"
IDS_ERROR = "Error"
IDS_IN_CONCRETE_SLAB = "in Concrete Slab"
IDS_IN_STEEL_TOP_FLANGE = "in Steel Top Flange"
IDS_IN_STEEL_WEB = "in Steel Web"
IDS_IN_STEEL_BOT_FLANGE = "in Steel Bottom Flange"
IDS_PLASTIC_NEUTRAL_AXIS_IN_STEEL_BOT_FLANGE = "Plastic neutral axis in steel bottom flange"
IDS_PLASTIC_NEUTRAL_AXIS_IN_STEEL_WEB = "Plastic neutral axis in steel web"
IDS_PLASTIC_NEUTRAL_AXIS_IN_WEB = "Plastic neutral axis in web"
IDS_PLASTIC_NEUTRAL_AXIS_IN_STEEL_WEB_HOLE = "Plastic neutral axis in steel web hole"
IDS_PLASTIC_NEUTRAL_AXIS_IN_STEEL_TOP_FLANGE = "Plastic neutral axis in steel top flange"
IDS_PLASTIC_NEUTRAL_AXIS_IN_CONCRETE_SLAB = "Plastic neutral axis in concrete slab"
IDS_CHECK_LONGITUDINAL_SHEAR_RESISTANCE = "Check Longitudinal Shear Resistance"
IDS_CACULATE_LONGITUDINAL_SHEAR_FORCE = "Calculate longitudinal shear force"
IDS_CALCULATE_DESIGN_SHEAR_RESISTANCE_OF_HEADED_STUD = "Calculate design shear resistance of headed stud"
IDS_BENDING_RESISTANCE = "Bending resistance"
IDS_LONGITUDINAL_SHEAR_RESISTANCE = "Longitudinal shear resistance"
IDS_TABLE_OF_CALCULATION_FOR_K = "Table of calculation for k"
IDS_VERTICAL_SHEAR_RESISTANCE = "Vertical shear resistance"
IDS_LONGITUDINAL_DIRECTION = "Longitudinal Direction"
IDS_MOMENT_CAPACITY_CALCULATION_REFERENCE = "The sign of moment capacity is determined by the direction of the moment regardless of the direction of the force."
IDS_EFFECTIVE_WIDTH = "Effective Width"
IDS_CHECK_REQUIREMENT_FOR_STUD_SMALL = "Check requirement for stud"
IDS_CHECK_SIZE_SMALL = "Check size"
IDS_CHECK_MATERIAL_SMALL = "Check material"
IDS_EC_MAJOR_AXIS_Y = "Major Axis (Y)"
IDS_EC_MINOR_AXIS_X = "Minor Axis (X)"
IDS_CHECK_VERTICAL_SHEAR_RESISTANCE = "Check vertical shear resistance"
IDS_EC_REPORT_JP_TEST = "EC_Report_JP-Test(Lang:JP)"
IDS_EC_REPORT_RUS_TEST = "EC_Report_RUS-Test(Lang:RUS)"
IDS_EC_REPORT_TW_TEST = "EC_Report_TW-Test(Lang:TW)"
IDS_PLASTIC_MOMENT_RESISTANCE = "塑性弯矩承载力计算"
